#ЕСли Не ВебКлиент ИЛИ ТонкийКлиент Тогда
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ОтправкаСообщенийТГ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка,
		|	ВКМ_ТокенТГ.Значение КАК ТокенТГ,
		|	ВКМ_ИдентификаторГруппыТГ.Значение КАК ГруппаТГ
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту,
		|	Константа.ВКМ_ТокенТГ КАК ВКМ_ТокенТГ,
		|	Константа.ВКМ_ИдентификаторГруппыТГ КАК ВКМ_ИдентификаторГруппыТГ";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТокенТГ = ВыборкаДетальныеЗаписи.ТокенТГ;
		ГруппаТГ = ВыборкаДетальныеЗаписи.ГруппаТГ;
		ТекстСообщения = ВыборкаДетальныеЗаписи.ТекстСообщения;
		
		АдресТГ = "api.telegram.org";
		Соединение = Новый HTTPСоединение(АдресТГ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL(, , ));
		
		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		АдресЗапроса = "bot" +ТокенТГ+ "sendMessage?chat_id-" +Формат(ГруппаТГ, "ЧГ=");
		Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(Запрос);
			
			Если Не Результат.КодСостояния = 200 Тогда
				ВызватьИсключение "Ошибка проверки связи";
			КонецЕсли;
			
			Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли