#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
   
	СформироватьДвиженияУдержания();
	
	РассчитатьУдержания();
	
	СформироватьДвиженияВзаиморасчетыСКлиентами();
	
КонецПроцедуры
		
Процедура СформироватьДвижения()
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = Строка.СуммаПремии;
				
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьдвиженияУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииУдержания.Ссылка,
		|	ВКМ_НачислениеФиксированнойПремииУдержания.НомерСтроки,
		|	ВКМ_НачислениеФиксированнойПремииУдержания.Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииУдержания.Подразделение,
		|	ВКМ_НачислениеФиксированнойПремииУдержания.ВидРасчета
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.Удержания КАК ВКМ_НачислениеФиксированнойПремииУдержания
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииУдержания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Выборка.ВидРасчета;
			Движение.Подразделение = Выборка.Подразделение;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка) КАК
		|		ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Подразделение");
	Измерения.Добавить("Сотрудник");
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.РезультатБаза * 0.13;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыСКлиентами();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Подразделение,
	|	ВКМ_ДополнительныеНачисления.Результат
	|ПОМЕСТИТЬ ВТ_ДопНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник,
	|	ВКМ_Удержания.Подразделение,
	|	ВКМ_Удержания.Результат КАК РезультатУдерж
	|ПОМЕСТИТЬ ВТ_Удержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ДопНачисления.Сотрудник, ВТ_Удержания.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВТ_ДопНачисления.Подразделение, ВТ_ДопНачисления.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ВТ_ДопНачисления.Результат, 0) - ЕСТЬNULL(ВТ_Удержания.РезультатУдерж, 0) КАК Результат
	|ИЗ
	|	ВТ_ДопНачисления КАК ВТ_ДопНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	|		ПО ВТ_ДопНачисления.Сотрудник = ВТ_Удержания.Сотрудник
	|		И ВТ_ДопНачисления.Подразделение = ВТ_Удержания.Подразделение";
		
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	 
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Подразделение = Выборка.Подразделение;
		Движение.Сумма = Выборка.Результат;
	
	КонецЦикла;
	
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры
#КонецОбласти

#КонецЕсли