
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
	Объект.ОтпускаСотрудников.Загрузить(ТаблицаОтпусков);   
	УдалитьИзВременногоХранилища(Параметры.Адрес);	
	ОбновитьДиаграммуГанта();
	                              
КонецПроцедуры
                                     
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДиаграммуГанта();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуГанта()
	
 	ГрафикОтпусков.Очистить();
 	
 	ГрафикОтпусков.Обновление = Ложь;
 
 	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
 	
	Для Каждого Строка  Из Объект.ОтпускаСотрудников  Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);

		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);

		Интервал = Значение.Добавить();

		Интервал.Начало = Строка.ДатаНачала;

		Интервал.Конец = Строка.ДатаОкончания;

	КонецЦикла;
	
 	ГрафикОтпусков.Обновление = Истина;
 	
КонецПроцедуры

