
#Область ОбработчикиСобытийформы

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	АбонентскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Если Объект.ВидДоговора = АбонентскоеОбслуживание Тогда
		Элементы.ГруппаРеквизитовДоговора.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	АбонентскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Если Объект.ВидДоговора = АбонентскоеОбслуживание Тогда;
		Элементы.ГруппаРеквизитовДоговора.Видимость = Истина;	
	Иначе 
     	Элементы.ГруппаРеквизитовДоговора.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти






